
%Îó²îÀ©É¢
% % Lienx=[0 440 800 1200 1500 2000 2400];
% Panx=[0 440 800 1200 1500 2000 2400 2925];
% Proposedx=[0 440 800 1200 1500 2000 2400 3518];
% % Lien=[];
% Pan=[0 0.333 0.590 0.674 0.679 0.690 0.789 0.875];
% Proposed=[0 0.500 0.853 1.064 1.138 1.270 1.288 1.308];

% matlab
% % Lienx=[0 440 800 1200 1500 2000 2400];
% Panx=[0 440 800 1200 1500 2000 2400 2925];
% Proposedx=[0 440 800 1200 1500 2000 2400 3518];
% % Lien=[];
% Pan=[0 0.314 0.424 0.518 0.576 0.659 0.707 0.762];
% Proposed=[0 0.675 0.891 1.078 1.199 1.362 1.468 1.521];

% 2012
Lienx=[0 440 1200 2000 5000 12000 15000 30000 63006];
Panx=[0 440 1200 2000 5000 12000 13521];
Proposedx=[0 440 1200 2000 5000 12000 15000 17301];
Lien=[0 0.824  0.928  0.955 0.982 0.993 0.996 0.999 1];
Pan=[0 0.450 0.674 0.763 0.865 0.914 0.916];
Proposed=[0 0.741 0.909 0.957 1.006 1.042 1.071 1.072];

figure
hold on
plot(Lienx(:),Lien,'g-+');
plot(Panx(:),Pan,'b-x');
plot(Proposedx(:),Proposed,'r-o');
width=400;%¿í¶È£¬ÏñËØÊý
height=300;%¸ß¶È
left=200;%¾àÆÁÄ»×óÏÂ½ÇË®Æ½¾àÀë
bottem=100;%¾àÆÁÄ»×óÏÂ½Ç´¹Ö±¾àÀë
ylim([0,5])
set(gcf,'position',[left,bottem,width,height])
xlabel('Embedding payload \itC_{pure}\rm');
ylabel('Embedding Efficiency \itEE\rm');
legend('Lien et al.','Pan et al.','Proposed');
