str = ['E:\ÁÕ\RDH-halftone\×´Ì¬»ú\dataset\512\Îó²îÀ©É¢_BOSSbase_1.01_HT_org\8.bmp']; 
img = imread(str);
figure
l1=[255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 255 255 0 255 0 255 0 0 0 255 0 0 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0];
img(401:401,169:244)=l1;
length(l1)
length(img(401:401,169:244))

l2=[0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255    0 255 255 255 255 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 0 255 255 255];
length(l2)
img(402:402,169:244)=l2;

l3=[1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 0 0 1 0 0 0 0 0 0 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0];
length(l3)
img(403:403,169:244)=l3;

l4=[1 1 0 1 0 1 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 1 1 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1];
length(l4)
img(404:404,169:244)=l4;

imshow(img,[]);
img2=img(401:404,169:244);
figure
imshow(img2,[]);
% img3=img2;
% img3(6,5)= ~img3(6,5);
% img3(8,17)= ~img3(8,17);
% img3(8,9)= ~img3(8,9);
% % subplot(2,2,1)
% figure
% imshow(img3,[]);
% img(73:86,114:143)=img3;
% figure
% imshow(img,[]);
%% Ç¶Èı¸öµã²âÊÔ
% img2(5:7,28:30)   %24
% img2(22:24,26:28) %13
% img2(10:12,23:25) %21

% 
% img3=img2;
% img3(6,29)=~img3(6,29);
% img3(23,27)=~img3(23,27);
% img3(11,24)=~img3(11,24);
% % subplot(2,2,2)
% figure
% imshow(img3,[]);
% % save('E:\ÁÕ\IEEE\RDH\eye_flip1','img3')
% [d,map] = drdm(img2,img3);
% d
% 
% img4=img2;
% img4(32:34,28:30) %8
% img4(36:38,17:19) %9
% img4(16:18,33:35) %5
% img4(33,29)=~img4(33,29);
% img4(37,18)=~img4(37,18);
% img4(17,34)=~img4(17,34);
% % subplot(2,2,3)
% figure
% imshow(img4,[]);
% [d,map] = drdm(img2,img4);
% d
% 
% img5=img2;
% img5(28:30,34:36) %1
% img5(8:10,27:29) %4
% img5(16:18,34:36) %2
% img5(29,35)=~img5(29,35);
% img5(9,29)=~img5(9,29);
% img5(17,35)=~img5(17,35);
% figure
% % subplot(2,2,4)
% imshow(img5,[]);
% [d,map] = drdm(img2,img5);
% d

%% 
% img2(5:7,8:10)
% img3=img2;
% img3(6,9)=~img3(6,9);
% figure
% imshow(img3,[]);
% 
% img4=img2;
% img4(6,9:11)
% img4(6,9:11)=~img4(6,9:11);
% figure
% imshow(img4,[]);
% 
% img5=img2;
% img5(6,9:11)
% img5(5,10)=~img5(5,10);
% figure
% imshow(img5,[]);
%%
% img4=img2;
% figure
% imshow(img4,[]);
% % 
% img5=img3;
% img5(8,23)=~img5(8,23);
% img5(6,5)=~img5(6,5);
% figure
% imshow(img5,[]);
% img(73:86,114:143)=img5;
% img5=int16(img5);
% 
% img6=img3;
% img6(8,21)=~img6(8,21);
% img6(8,9)=~img6(8,9);
% img6(9,27)=~img6(9,27);
% img6(8,17)=~img6(8,17);
% figure
% imshow(img6,[]);
% img6=int16(img6);
% img(73:86,114:143)=img6;
% figure
% imshow(img,[]);